function setup() {
  setCanvasContainer('p5-canvas', 1, 1, true);
  background('white');
}

function draw() {
  background(255);
  rectMode(CORNER);
  fill(255);
  colorMode(RGBA);
  //   stroke(0);
  //   strokeWeight(1);
  noStroke();

  //벽
  fill('#e7cbcb');
  rect(0, 0, 1000);

  //풍경
  ////창문틀
  fill('#cc9999');
  rect(0, 0, 300, 400);
  fill('#aa7d7d');
  rect(-10, 395, 330 + 10, 35, 5);
  ////하늘
  fill('#4c5a66');
  rect(0, 0, 280, 380);
  fill('#384254');

  rect(0, 50, 160, 330);
  rect(190, 0, 90, 380);
  fill('#262d35');
  rect(160, 50, 30, 330);
  ////창문틀
  fill('#cc9999');
  rect(80, 0, 20, 380);
  stroke('#aa7d7d');
  strokeWeight(10);
  line(300, 0, 300, 400);
  noStroke();
  //불빛
  fill('#e0d59b');
  rect(210, 20, 60, 20);
  //   rect(210, 70, 60, 20);
  //   rect(210, 120, 60, 20);
  rect(210, 170, 40, 20);
  rect(240, 220, 30, 20);
  //   rect(210, 270, 60, 20);
  rect(0, 100, 80, 20);
  rect(100, 100, 30, 20);

  noStroke();

  //책장
  fill('#919bb5');
  rect(700, 120, 1000, 1000);
  fill('#727c96');
  rect(725, 150, 1000, 700);
  fill('#919bb5');
  rect(725, 265, 250, 15);
  rect(725, 265 + 1 * 115, 250, 15);
  rect(725, 265 + 2 * 115, 250, 15);
  rect(725, 265 + 3 * 115, 250, 15);
  rect(725, 265 + 4 * 115, 250, 15);

  //책
  //   fill(255);
  //   ////1
  //   rect(725 + 0, 200 - 20, 20, 65 + 20);
  //   rect(725 + 20, 200 - 10, 30, 65 + 10);
  //   rect(725 + 50, 200 - 30, 15, 65 + 30);
  //   rect(725 + 65, 200 - 25, 20, 65 + 25);
  //   rect(725 + 80, 200 - 25, 40, 65 + 25);
  //   rect(725 + 120, 200 - 10, 25, 65 + 10);
  //   rect(725 + 145, 200 - 15, 15, 65 + 15);
  //   rect(725 + 160, 200 - 15, 20, 65 + 15);
  //   rect(725 + 180, 200 - 25, 20, 65 + 25);
  //   rect(725 + 200, 200 - 25, 10, 65 + 25);
  //   rect(725 + 210, 200 - 20, 20, 65 + 20);
  //   rect(725 + 230, 200 - 25, 20, 65 + 25);
  ////2

  //책상
  fill(255);
  ////위
  fill('#cc9999');
  rect(260, 570, 500, 25);
  ////다리
  fill('#8e6666');
  rect(290, 595, 25, 280);
  rect(710, 595, 25, 280);

  //렌턴
  fill('#8298bf');
  quad(380, 380 + 25, 460, 380 + 25, 485, 470 + 20, 355, 470 + 20);

  fill('#384254');
  rect(410, 490, 20, 70);
  rect(390, 560, 60, 10);

  //액자
  fill('#cc9999');
  rect(520, 510, 90, 60);
  fill('#ffffff');
  rect(530, 520, 70, 40);
  fill('#664b4b');
  triangle(610, 510, 620, 570, 610, 570);
  stroke('#a07272');
  strokeWeight(4);
  line(262, 570, 758, 570);
  strokeWeight(0);

  //콘센트
  fill('#ffffff');
  rect(200, 800, 30, 53, 5);
  fill('#bec5d3');
  circle(215, 815, 20);
  circle(215, 838, 20);

  //선반
  fill('#919bb5');
  rect(-10, 650, 120 + 10, 230, 10);
  fill('#4e5975');
  rect(0, 640 + 115, 120, 10);
  fill('#ffffff');
  rect(-10, 690, 30 + 10, 10, 20);
  rect(-10, 690 + 105, 30 + 10, 10, 20);

  //의자
  fill('#8298bf');
  rect(420, 700, 180, 25, 7);
  fill('#384254');
  rect(440, 725, 140, 15);
  rect(500, 740, 20, 120);
  rect(480, 860, 60, 15);

  //시계
  rectMode(CENTER);
  fill('#919bb5');
  circle(600, 210 - 70, 150);
  fill('#677289');
  circle(600, 210 - 70, 110);
  fill('#ffffff');
  circle(600, 210 - 70, 100);
  stroke('#5d7599');
  strokeWeight(5);
  line(600, 210 - 70, 575, 200 - 70);
  line(600, 210 - 70, 600, 240 - 70);

  //바닥
  rectMode(CORNER);
  strokeWeight(0);
  fill('#665959');
  rect(0, 875, 1000);
  //
}
